proxy1 = ['193.111.152.224:4734', '193.111.152.95:4734', '193.111.152.122:4734',
         '193.111.152.98:4734', '193.111.152.239:4734', '193.111.152.106:4734',
         '193.111.152.248:4734', '193.111.152.119:4734', '193.111.152.80:4734',
         '193.111.152.185:4734', '193.111.152.36:4734', '193.111.152.238:4734']

proxy = ['193.111.152.85:4734', '193.111.152.57:4734', '193.111.152.116:4734',
         '193.111.152.14:4734', '193.111.152.28:4734', '193.111.152.207:4734',
         '193.111.152.32:4734', '193.111.152.164:4734', '193.111.152.117:4734',
         '193.111.152.209:4734', '193.111.152.129:4734', '193.111.152.251:4734',
         '193.111.152.8:4734', '193.111.152.89:4734', '193.111.152.186:4734',
         '193.111.152.38:4734', '193.111.152.128:4734']

list_ignore = ["Scrooge_girl", "gomelpribory", "Andrei_prime", "mybitok",
               "Divbit", "liondell", "Yoo2", "kiril360", "Mikki666",
               "sonitona", "Nici13131313", "semo93799921",
               "freemanlife0", "Dilet", "unclerizo",
               "Ambassador22x", "Yoo2",
               "kiril360", "Nikolabus", "andruhinby",
               "masterjorj", "andruhinby", "maximbaty58655865"]

SellURL = "https://localbitcoins.net/ad/878212/" # мое объявление
Me_id = SellURL.split('/')[-2]
Me_3 = str("/api/ad-equation/" + Me_id + "/")

X = 0.1 #  Шаг изменения цены
Low = 20280 # Нижняя граница при Продаже
url = "https://localbitcoins.net/ru/buy-bitcoins-online/byn/"
proxy_logpas = '//user39773:rdwa08@' # пароль прокси
url2 = 'https://httpbin.org/ip'

MyMess = {u'msg': '''Салют!!!'''} # текст первого сообщения
